Tekla Open API Reference for Tekla Structures 2025
Matrix.GetTranspose Method
 Returns a new matrix which is a transpose of the current matrix. The transposed matrix is an inversion of the current matrix, if the current matrix was a valid rotation matrix.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Matrix GetTranspose()
Public Function GetTranspose As Matrix
Return Value
Type: Matrix
The new transposed matrix.
See Also
Reference
Matrix Class
Tekla.Structures.Geometry3d Namespace